---
kind: method
id: M:Autodesk.Revit.DB.TessellatedBuildIssue.ReportIssueToDataSource
source: html/e47fc5bf-bcf3-19a1-2045-b76cf01cd535.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssue.ReportIssueToDataSource Method

Reports whether this issue should be reported to the
 company which wrote the software which produced the face set data
 (true), or to Autodesk (false).

## Syntax (C#)
```csharp
public bool ReportIssueToDataSource()
```